---
kind: type
id: T:Autodesk.Revit.DB.FabricationPartType
source: html/261b8995-37db-ad23-9ae6-929cb0a77122.htm
---
# Autodesk.Revit.DB.FabricationPartType

Represents a fabrication component type in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FabricationPartType : ElementType
```

## Remarks
For the product-based MAP parts, every size is a new part type in Revit. For others, one part type can have many sizes.